Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: བརྒྱ་བྱིན་ཉེ་བར་སོང་སྟེ། བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཅོམ་ལྡན་འདས་བདག་གང་དུ་མཆིས་པར་བགྱི་བ་དང་།
en: Śakra approached the Bhagavat and asked, ‘Bhagavat, where shall I sit?’ “

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་བཀའ་སྩལ་པ། གནོད་སྦྱིན་དག་ཇི་སྙེད་ལྷགས་པ་རྣམས་འཁོད་ཅིག །
en: The Tathāgata Śākyamuni said, ‘As many yakṣas as have come may all sit in here.’

source: དེ་ནས་སཱ་ལའི་ཕུག་དེར་ཇི་ལྟར་གནོད་སྦྱིན་གང་གཱའི་ཀླུང་བཅུ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་དག་ཞུགས་ཏེ་འཁོད་པ་དེ་ལྟར་སཱ་ལའི་ཕུག་དེ་རྒྱ་ཆེ་བར་གྱུར་ནས།
en: Then the tree hollow became so vast that as many yakṣas as there are grains of sand in twelve Ganges Rivers entered and sat inside.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེས་འཁོར་དེ་དག་ལ་འདི་ལྟར་ཆོས་བསྟན་ཏེ།
en: In that way the Tathāgata Śākyamuni gave a Dharma teaching to the assembly.

source: ཇི་ལྟར་འཁོར་དེ་ན་གང་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དག་འཁོད་པ་དེ་དག་གིས་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པའི་གཏམ་ཐོས་ཤིང་དེ་དག་ལས་དུང་ཕྱུར་ཕྲག་དགུ་དང་། བྱེ་བ་ཕྲག་དགུས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ།
en: Those in the assembly who were followers of the Śrāvakayāna heard teachings on the Śrāvakayāna, and from among them 990,000,000 attained the result of becoming a stream enterer.

source: །འཁོར་དེ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཐེག་པ་པ་གང་ཡིན་པ་དེ་དག་གིས་ནི་ཐེག་པ་ཆེན་པོའི་གཏམ་འབའ་ཞིག་ཐོས་སོ།
en: Those in the assembly who followed the yāna of the highest, most complete enlightenment heard only the Mahāyāna teachings.

source: །དེ་ན་དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་པ་ལ་སོགས་པ་ཁྲག་ཁྲིག་ཕྲག་བཅྭ་བརྒྱད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་གནས་པར་གྱུར་ཏོ།
en: Eighteen hundred million of them, such as the gandharva Pañcaśikha, attained irreversibility from the highest, most complete enlightenment.

source: །གང་དག་གིས་ཐེག་པ་གསུམ་པོ་དག་ཏུ་སེམས་མི་བསྐྱེད་པ་དེ་དག་ལས་ཁ་ཅིག་གིས་ནི་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །དེ་དག་ལས་ཁ་ཅིག་གིས་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་སེམས་བསྐྱེད་དོ། །ཁ་ཅིག་གིས་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པར་སེམས་བསྐྱེད་དོ།
en: Among those who had not yet developed an aspiration for any of the three yānas, some developed an aspiration for the highest, most complete enlightenment; some developed an aspiration for the Pratyekabuddhayāna; and some developed an aspiration for the Śrāvakayāna. “

source: །དེར་བརྒྱ་བྱིན་ཀཽ་ཤི་ཀ་དེ་ཡང་འཇིགས་པ་ལས་ཡོངས་སུ་གྲོལ་ཞིང་ཚེ་ལོ་སྟོང་དུ་ནུར་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་གནས་པར་གྱུར་ཏེ།
en: Śakra Kauśika was freed from his fear, his life was extended for a thousand years, and he attained irreversibility from the highest, most complete enlightenment. “

source: རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་དེ་ལྟ་དེ་ལྟར་གོ་སྐབས་ཡངས་པ་ཡིན་ནོ།
en: Noble sons, the Tathāgata Śākyamuni can provide that kind of vast space.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་ཡང་འདི་ལྟར་རྒྱ་ཆེ་བ་ཡིན་ཏེ། དེ་བཞིན་གཤེགས་པ་དེའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་མཐའ་ནི་སུས་ཀྱང་ཚད་གཟུང་བའམ་བགྲང་བར་མི་ནུས་སོ།
en: The collection of praises of that tathāgata is similarly vast; no one can measure or calculate the extent of the collection of praises of that tathāgata.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་ཐབས་ལ་མཁས་པ་ཡང་རྒྱ་ཆེ་བ་ཡིན་ཏེ། དེ་བཞིན་གཤེགས་པ་དེའི་ཐབས་ལ་མཁས་པའི་མཐའ་ནི་སུས་ཀྱང་ཚད་གཟུང་བར་མི་ནུས་སོ།
en: That tathāgata’s skill in methods for ripening beings is also vast; no one can grasp the extent of that tathāgata’s skill in methods. “

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་དེའི་སྐུ་ཡང་རྒྱ་ཆེ་བ་ཡིན་ཏེ། དེའི་སྤྱི་གཙུག་བལྟ་བའམ། སྐུའི་མཐའ་ནི་སུས་ཀྱང་ཚད་གཟུང་བར་མི་ནུས་སོ།
en: Noble sons, that tathāgata’s body is also vast; no one can see the crown of his head or discover the end of that tathāgata’s body.

source: །གལ་ཏེ་དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེ་ན་སེམས་ཅན་ཇི་སྙེད་འདུས་པར་གྱུར་པ་འདི་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་ཁོང་དུ་ཞུགས་པར་གྱུར་ཅིང་དེ་དག་ཐམས་ཅད་དེ་ན་རྒྱུ་བར་གྱུར་ཏམ།
en: If all the beings in the Sahā buddha realm were to enter the Tathāgata Śākyamuni’s body, those beings would be able to wander around within it.

source: སེམས་ཅན་དེ་དག་དེ་བཞིན་གཤེགས་པ་དེའི་སྤུའི་སྒོ་གཅིག་ཏུ་ཞུགས་ཤིང་འབྱུང་བར་གྱུར་ཀྱང་། དེ་དག་གིས་ཆེར་ན་ལྷའི་མིག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེའི་སྤུའི་སྒོ་གཅིག་གི་མཐའ་ཡང་བྲི་བའམ་གང་བར་ཚད་གཟུང་བར་མི་ནུས་ཏེ།
en: Even if those beings were to go in and out of just one pore on the Tathāgata’s body, not one, even those with divine sight, would perceive the extent of that one pore, whether it was expanded or contracted.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེའི་སྐུ་ནི་དེ་ལྟར་རྒྱ་ཆེ་བ་ཡིན་ནོ།
en: That is how vast the body of the Tathāgata Śākyamuni is. “

source: །རིགས་ཀྱི་བུ་དག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Noble sons, the Tathāgata Śākyamuni also has a vast buddha realm.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་ཇི་སྙེད་པ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ད་ལྟར་ངའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་བཞིན་དུ་སེམས་ཅན་རྣམས་ཀྱིས་ཡོངས་སུ་གང་བར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་ཞུགས་པར་གྱུར་ཀྱང་དེ་དག་ཐམས་ཅད་དེ་ན་རྒྱུ་བར་འགྱུར་རོ།
en: For example, if as many buddha realms in the ten directions as there are grains of sand in the Ganges River were to be as filled with beings as the Sahā buddha realm is, and all those beings were to enter the Sahā realm, they would be able to move around in it.

source: དེ་བཞིན་གཤེགས་པ་དེས་སྔོན་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ན་སྨོན་ལམ་དེ་ལྟ་བུ་བཏབ་པའི་ཕྱིར་རོ།
en: It is because that is what the Tathāgata prayed for when he first developed the aspiration for the highest, most complete enlightenment. “

source: །རིགས་ཀྱི་བུ་དག་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་དག་ལྟ་ཞོག་གི །རིགས་ཀྱི་བུ་དག་གལ་ཏེ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་སྟོང་གི་བྱེ་མ་སྙེད་པོ་དེ་ལྟར་རྒྱ་ཆེ་བ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ད་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་བཞིན་དུ་སེམས་ཅན་རྣམས་ཀྱིས་ཡོངས་སུ་གང་བར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་ཞུགས་པར་གྱུར་ཀྱང་དེ་དག་ཐམས་ཅད་དེ་ན་རྒྱུ་བར་འགྱུར་རོ།
en: Noble sons, never mind realms equal to the number of grains of sand in the Ganges River—noble sons, if buddha realms as numerous as the number of grains of sand in a thousand Ganges Rivers were to be filled with beings in the way that the Sahā buddha realm is, and all those beings were to enter Sahā, they would be able to wander around in different directions. “

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་དེས་སྔོན་དང་པོ་སེམས་བསྐྱེད་པ་ན་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་དེ་ལྟ་བུ་བཏབ་པས་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་ཆེན་པོ་དེ་ལྟ་བུ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Noble sons, such was that tathāgata’s prayer for the attainment of wisdom when he first developed the aspiration for the highest, most complete enlightenment. Thus the Tathāgata Śākyamuni possesses a vast buddha realm.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་ཇི་སྐད་སྨོས་པའི་ཆོས་བཞི་པོ་དེ་དག་གི་དེ་བཞིན་གཤེགས་པ་གཞན་དག་ལས་ཁྱད་པར་དུ་འཕགས་པ་ཡིན་ནོ།
en: Due to these four qualities that have been described, the Tathāgata Śākyamuni is superior to all other tathāgatas. “

source: །རིགས་ཀྱི་བུ་དག་ཁྱོད་ཀྱིས་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་དག་ལོང་ལ་ནུབ་ཕྱོགས་ལོགས་སུ་རང་རང་གིས་ཇི་ལྟར་མཐོང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་དེང་ཤིག །
en: Noble sons, take these flowers, which have the stainless beauty of the color of the moon, and go to the Sahā buddha realm, which I can see in the west.

source: ངའི་ཚིག་གིས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་སྙུན་མི་མངའ་འམ་ཐུགས་བདེའམ་ཞེས་ཀྱང་སྙུན་གསོལ་ཅིག །
en: There inquire after his health, by repeating these words of mine to the Tathāgata Śākyamuni: ‘Are you well? Are you at ease?’ ”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོ་དེས་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་དག་བླངས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་གསང་བསྒྲགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྣང་བའི་འོད་ཟེར་ལ་བྱིན་ནས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་ངའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པས་ཁྱེད་ཅག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་དེང་ཤིག །
en: Then the Tathāgata Vimalateja­guṇa­rāja picked up the flowers that had the stainless beauty of the color of the moon, gave them to the bodhisattva Rahagarjita and the bodhisattva Jyotiraśmi, and said, “Noble sons, go to the Sahā realm through my miraculous power.”

source: དེ་ན་སྲོག་ཆགས་ཉི་ཁྲིས་ཀྱང་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་མཐུས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་། བསྙེན་བཀུར་བགྱི་བའི་སླད་དུ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་མཆི་ལགས་སོ།
en: Then twenty thousand beings said, “Bhadanta Bhagavat, we also, through the power of the Tathāgata, will go to the Sahā realm in order to see, pay homage to, and attend upon the Tathāgata Śākyamuni.” “

source: །དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེང་ཤིག །
en: Noble sons, go as you wish,” replied the Tathāgata Vimalateja­guṇa­rāja.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོ་དེའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་གསང་བསྒྲགས་དང་། སྣང་བའི་འོད་ཟེར་དེ་གཉིས་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཁྲི་དང་ལྷན་ཅིག་འགྲོགས་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་ཀུན་དུ་རྒྱས་པ་ནས་འཕགས་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་ཕྱིན་ཏེ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་སོ་སོར་འཁོད་ནས།
en: Then, through the miraculous power of the Tathāgata Vimalateja­guṇa­rāja, the two bodhisattvas, Rahagarjita and Jyotiraśmi, together with twenty thousand other bodhisattvas, rose from the realm Saṃpuṣpita and in one instant of the mind arrived in the Sahā buddha realm and were upon Vulture Peak Mountain.

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་ས་ཡ་ཕྲག་དགུ་དང་ཆིག་འབུམ་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་ཀུན་དུ་རྒྱས་པ་ཞེས་བགྱི་བ་མཆིས་ཏེ། དེ་ན་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོ་ཞེས་བགྱི་བ་བཞུགས་སོ།
en: They placed their palms together and, facing the Bhagavat, the Tathāgata Śākyamuni, they said, “Bhadanta Bhagavat, in the eastern direction from this buddha realm, beyond 9,100,000 buddha realms, there is a realm called Saṃpuṣpita in which dwells the tathāgata named Vimalateja­guṇa­rāja.

source: །དེ་བཞིན་གཤེགས་པ་དེ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་ཚོགས་ལ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་བསྔགས་པ་སྒྲོགས་ཤིང་འདི་སྐད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ།
en: That tathāgata has praised the qualities of the Tathāgata to his assembly of bodhisattvas, saying, ‘In the Sahā realm there dwells the tathāgata named Śākyamuni.

source: །དེ་བཞིན་གཤེགས་པ་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། དེས་ང་ཐམས་ཅད་ཀྱི་དང་པོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཞག་སྟེ་རབ་ཏུ་གནས་པར་བྱས་སོ།
en: In the past, when that tathāgata was a bodhisattva practicing bodhisattva conduct, he was the very first to make me obtain, enter into, and remain in the aspiration for the highest, most complete enlightenment.

source: །དེའི་ཚིག་གིས་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: It is through his words that I developed the aspiration for the highest, most complete enlightenment.

source: །དེ་བཞིན་གཤེགས་པ་དེས་ང་དང་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བཞག་པ་ནས། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་ཆོས་བཞི་པོ་དེ་དག་གིས་ཁྱད་པར་དུ་འཕགས་པ་ཡིན་ནོ་ཞེས་ཇི་སྐད་སྔར་སྨོས་པའི་བར་དག་དེ་སྐད་དུ་གསུངས་ཏེ།
en: It was that tathāgata who brought me to the perfection of generosity…’ ” And they continued, as previously described, up to the superiority of his four qualities.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དེས་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་དག་ཀྱང་བསྐུར་ཞིང་བཅོམ་ལྡན་འདས་ལ་སྙུན་མི་མངའ་འམ།
en: They said, “That tathāgata has sent to you these flowers, which have the stainless beauty of the color of the moon, and inquires after your health, asking, ‘Are you well?

source: ཐུགས་བདེའམ་ཞེས་ཀྱང་སྙུན་གསོལ་ལགས་སོ།
en: Are you at ease?’ ”

source: །དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་མངོན་པར་དགའ་བ་ན་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་གདན་ཡང་གཡོས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་དེར་འདུས་པར་གྱུར་པ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་གདན་གཡོས་པར་མཐོང་སྟེ།
en: In the same way, in the buddha realm Abhirati, the seat on which the Tathāgata Akṣobhya sat shook. The bodhisattvas who were assembled there saw the Tathāgata Akṣobhya’s seat shake.

source: ཡོངས་སུ་ཞུས་པ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ་ཇི་སྐད་སྔར་སྨོས་པའི་བར་དེ་དག་ཐམས་ཅད་ཀྱང་བརྗོད་པར་བྱའོ།
en: They questioned the Tathāgata, and so on, as has been previously described, and it was the same for all the others.

source: །དེའི་ཚེ་ན་ཤར་ཕྱོགས་ལོགས་ནས་དེ་བཞིན་གཤེགས་པའི་ཕོ་ཉ་བྱང་ཆུབ་སེམས་དཔའ་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ཡོངས་སུ་ཞུ་བ་དང་མཆོད་པ་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་དག་ཐོགས་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་ལྷགས་སོ།
en: Then, at that time, there came to this Sahā buddha realm countless, innumerable bodhisattvas from the eastern direction as emissaries of the tathāgatas, carrying the flowers that had the stainless beauty of the color of the moon. They came so as to inquire about the Tathāgata Śākyamuni’s health, make offerings to him, pay homage to him, serve him, and listen to Dharma teachings from him.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་མཚན་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་བསྒྲགས་པ་དག་མཐར་ཕྱིན་མ་ཐག་ཏུ་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷོ་ཕྱོགས་ལོགས་ཀྱི་ཡོངས་སུ་བསྒྲགས་པ་བརྩམས་ཏེ།
en: As soon as the Bhagavat had concluded describing the names of the bhagavat buddhas, and their buddha realms in the eastern direction, the Bhagavat commenced upon describing those in the southern direction. “

source: རིགས་ཀྱི་བུ་ངས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ལྷོ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེ་ན་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་པའི་དཔལ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་གཟིགས་ཏེ། བཅོམ་ལྡན་འདས་དེ་ཡང་ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ངས་ཐམས་ཅད་ཀྱི་དང་པོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་ནས་ཇི་སྐད་སྔར་སྨོས་པའི་བར་དག་བཞིན་ནོ། །དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་འཛམ་བུའི་འོད་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབང་ཕྱུག་རྣམ་སྒྲོགས་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ལྷུན་པོ་རབ་གནས་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་འགྲོ་བའི་དབང་ཕྱུག་སཱ་ལའི་དབང་པོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོན་ཏན་དབང་པོའི་བ་གམ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་སེང་གེ་བསྒྱིངས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ནོར་བུ་གཞིར་བཀོད་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་སྲེད་མེད་ཀྱི་བུས་རྣམ་པར་རྒྱལ་བའི་སྙིང་པོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་འོད་འགྱེད་ཡང་དག་བསགས་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་བསྒྱིངས་པ་ཡང་དག་བསགས་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ལྷའི་ཟླ་བ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་སྐར་མའི་སྙིང་པོ་ཞེས་བྱ་བ་དང་།
en: Noble son, I see in the southern direction from this buddha realm, beyond as many buddha realms as there are grains of sand in the Ganges River, a realm called Sarvaśokāpagata.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཙན་དན་གྱི་རྩ་བ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་རྒྱུ་སྐར་ཆོ་ག་གྲགས་པ་ཞེས་བྱ་བ་དང་།
en: The tathāgata named Aśokaśrī resides, lives, and remains there, teaching the Dharma.

source: སངས་རྒྱས་ཀྱི་ཞིང་དྲི་མཆོག་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྟོབས་སཱ་ལའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཤིན་ཏུ་རྟོག་པ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་ཡིད་དུ་འོང་བའི་སྒྲ་དབྱངས་རྣམ་པར་བསྒྲགས་པ་ཞེས་བྱ་བ་དང་།
en: I was the one who made that bhagavat gain for the first time the aspiration for the highest, most complete enlightenment, and so on, as previously described. “

source: སངས་རྒྱས་ཀྱི་ཞིང་རྩོད་མེད་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་སཱ་ལའི་ཐིགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཟླ་བསྒྲགས་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་དབང་ཕྱུག་འོད་ཅེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་མངོན་པར་སྒྲོགས་པ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་སྒྲ་དབྱངས་ཡིད་དུ་འོང་བ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རིན་ཆེན་ཁྱུ་མཆོག་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་ཀླུ་དབང་རིན་ཆེན་ངོས་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རིན་ཆེན་ལྗོན་ཤིང་འབྲས་བུ་དཔག་མེད་རིན་པོ་ཆེ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་ཆོས་སྤྲིན་སྒྲ་དབྱངས་དབང་ཕྱུག་ཟླ་བ་ཞེས་བྱ་བ་དང་།
en: In the same way, I see, in the southern direction, the buddha realm Jambūprabha, in which there is the tathāgata named Dharmeśvaravinardi; and the buddha realm Merupratiṣṭhita, in which there is the tathāgata named Gatīśvarasālendra; and the buddha realm Guṇendraniryūha, in which there is the tathāgata named Siṃhavijṛmbhitarāja; and the buddha realm Maṇimūlavyūha, in which there is the tathāgata named Nārāyaṇavijitagarbha; and the buddha realm Muktāprabhasaṃcaya, in which there is the tathāgata named Ratna­guṇa­vijṛmbhita­saṃcaya; and the buddha realm Devasoma, in which there is the tathāgata named Jyotigarbha; and the buddha realm Candanamūla, in which there is the tathāgata named Nakṣatra­vidhāna­kīrti; and the buddha realm Viśiṣṭagandha, in which there is the tathāgata named Puṇyabala­sāla­rāja; and the buddha realm Suvidita, in which there is the tathāgata named Manojñaghoṣa­svara­vinardita; and the buddha realm Duraṇya, in which there is the tathāgata named Sālajaya­bindu­rājā; and the buddha realm Nardaścoca, in which there is the tathāgata named Tejeśvaraprabhāsa; and the buddha realm Abhigarjita, in which there is the tathāgata named Sumanojñasvaranir­ghoṣa; and the buddha realm Ratnavisabha, in which there is the tathāgata named Ratnatalanāgendra; and the buddha realm Palāmaratnavṛkṣaratna, in which there is the tathāgata named Dharma­megha­nirghoṣeśvarasaumya.”

source: དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་ལོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་གི་གདན་དག་གཡོས་ཤིང་།
en: In the same way, the seats of countless, innumerable bhagavat buddhas in the south shook.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་བསྔགས་པ་དང་། སྙན་པ་དང་། གྲགས་བརྗོད་པར་མཛད་པ་དང་།
en: Those bhagavat buddhas praised the Tathāgata Śākyamuni and described his renown and fame.

source: དེའི་ཚེ་ན་ལྷོ་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པའི་ཕོ་ཉ་བྱང་ཆུབ་སེམས་དཔའ་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ཡོངས་སུ་ཞུ་བ་དང་། ཆོས་མཉན་པའི་བར་གྱི་ཕྱིར་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་དག་ཐོགས་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་ལྷགས་པའི་བར་དུ་ཇི་སྐད་སྔར་སྨོས་པ་བཞིན་དུ་སྦྱར་རོ།
en: At that time, there came to this Sahā buddha realm countless, innumerable bodhisattvas from the southern direction, as emissaries of the tathāgatas, carrying the flowers that had the stainless beauty of the color of the moon. They came so as to inquire about the Tathāgata Śākyamuni’s health, and so on, as previously described, and to listen to Dharma teachings from him.

source: །ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ངས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་བདུན་འདས་པ་དེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་བློ་གྲོས་ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེ་ན་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་རི་བོ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པར་གཟིགས་ཏེ།
en: The Bhagavat said, “Noble sons, I see in the western direction from this buddha realm, beyond 970 trillion buddha realms, a realm called Upaśāntamati. The tathāgata named Ratnagiri resides, lives, and remains there, teaching the Dharma.

source: བཅོམ་ལྡན་འདས་དེ་ཡང་ང་སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཅིང་སྤྱད་པ་སྤྱོད་པ་ན་ངས་ཐམས་ཅད་ཀྱི་དང་པོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་ནས་ཇི་སྐད་སྔར་སྨོས་པའི་བར་དག་བཞིན་ནོ། །སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱང་དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: I was the one who made that bhagavat gain for the first time the aspiration for the highest, most complete enlightenment…,” and so on, as previously described.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་མཆོག་གི་མཛོད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དབྱངས་མཁྱེན་མཛོད་ཅེས་བྱ་བ་དང་། བ་བླ་གྲགས་པ་དང་། ཀུན་དུ་སྙིང་པོ་དང་། ཚངས་པའི་མེ་ཏོག་དང་། སྐུ་མཆོག་རྣམ་པར་གནོན་དང་། ཆོས་ཀྱི་ཤུགས་ཀྱི་སྒྲོན་མ་དང་།
en: In the western buddha realms there was the tathāgata named Vararaśmikośa, the tathāgata named Svarajñakośa, the tathāgata named Haritālakīrti, the tathāgata named Samantagarbha, the tathāgata named Brahmakusuma, the tathāgata named Karadharavikrama, the tathāgata named Dharmaveśapradīpa, the tathāgata named Asamantaramerusvaravighuṣṭarāja, and the tathāgata named Brahmendraghoṣa, and so on.

source: ལྷུན་པོ་ཕྲག་མེད་པ་སྒྲ་དབྱངས་རྣམ་པར་གྲགས་པའི་རྒྱལ་པོ་དང་། ཚངས་པའི་དབང་པོ་དབྱངས་དང་། དེ་བཞིན་དུ་ནུབ་ཕྱོགས་ལོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་གང་དག་གི་མཚན་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་ཡོངས་སུ་བསྒྲགས་པ་དེ་དག་གི་གདན་དག་གཡོས་ཤིང་།
en: The Tathāgata Śākyamuni gave the names of countless, innumerable bhagavat buddhas in the western direction, and their seats shook.

source: དེའི་ཚེ་ན་ནུབ་ཕྱོགས་ལོགས་ནས་སངས་རྒྱས་ཀྱི་ཕོ་ཉ་བྱང་ཆུབ་སེམས་དཔའ་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཆོས་མཉན་པའི་བར་གྱི་ཕྱིར་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་དག་ཐོགས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་ལྷགས་ཤིང་འཁོད་པའི་བར་དུ་ཇི་སྐད་སྔར་སྨོས་པ་བཞིན་དུ་སྦྱར་རོ། །དེ་བཞིན་དུ་བྱང་ཕྱོགས་དང་། དེ་བཞིན་དུ་སྟེང་དང་།
en: Then at that time, there came to this Sahā buddha realm countless, innumerable bodhisattvas from the western direction, as emissaries of the tathāgatas, carrying flowers that had the stainless beauty of the color of the moon, and so on, as previously described, in order to listen to Dharma teaching.

source: དེ་བཞིན་དུ་འོག་དང་། དེ་བཞིན་དུ་ཤར་ལྷོ་དང་། དེ་བཞིན་དུ་ལྷོ་ནུབ་དང་། དེ་བཞིན་དུ་ནུབ་བྱང་དང་། དེ་བཞིན་དུ་བྱང་ཤར་གྱི་ཕྱོགས་རྣམས་སུ་ཡང་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ་བརྗོད་པར་བྱའོ།
en: In the same way as it has been described, so it was for the north, above, below, the southeast, the southwest, the northwest, and the northeast.

source: །ཡང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ངས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་བྱང་ཤར་གྱི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་འདས་པ་དེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེ་ན་དེ་བཞིན་གཤེགས་པ་གདུང་བྲལ་མངོན་པར་འཕགས་པ་རྣམ་ཐོས་ཀྱི་བུ་སཱ་ལའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: Then the Tathāgata Śākyamuni said, “Noble son, in the northeastern direction from this buddha realm, beyond 980 trillion buddha realms, there is a realm called Vijaya.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཡང་ང་སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཅིང་།
en: The tathāgata named Vigatasaṃtāpodbhavavaiśravaṇasālarāja resides, lives, and remains there, teaching the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ངས་ཐམས་ཅད་ཀྱི་དང་པོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་བར་དག་ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་ནས།
en: When I was a bodhisattva and performing bodhisattva conduct for attaining the highest, most complete enlightenment, I was the one who first made him acquire the aspiration for the highest, most complete enlightenment and acquire the six perfections.

source: ཐམས་ཅད་ཀྱི་དང་པོར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་པ་དག་གི་ཐད་དུ་ཕུལ་ནས་དེར་དང་པོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོབ་བོ།
en: I was the first to bring him before a buddha, a bhagavat, who was present, existed, and lived there, and for the first time, he received the prophecy of his attainment of the highest, most complete enlightenment.”

source: །གང་གི་ཚེ་དེའི་མཚན་ཡོངས་སུ་བསྒྲགས་པ་དེའི་ཚེ་གདན་གཡོས་པ་ནས་ཁ་དོག་དང་། དབྱིབས་དང་། དད་པ་དང་། གཟུགས་དང་། སྒྲ་སྐད་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་དུ་མཐོང་ཞིང་ཆོས་ཀྱང་ཐོས་སོ་ཞེས་བྱ་བའི་བར་དུ་ཇི་སྐད་སྔར་སྨོས་པ་བཞིན་དུ་སྦྱར་རོ།
en: When the Tathāgata Śākyamuni said his name, at that time the Tathāgata Vigatasaṃtāpodbhavavaiśravaṇasālarāja’s seat shook, and so on, as previously described, and beings with 84,000 different colors, shapes, faiths, forms, and languages saw the Tathāgata Śākyamuni in that way and listened to Dharma teachings from him.

source: །འཁོར་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གཉིས་ལ་གཅིག་ནི་འཁྲུགས་མེད་རྩེ་མོ་ཞེས་བྱ་བ་དང་། ཅིག་ཤོས་ནི་སངས་རྒྱས་ཡང་དག་འདོད་ཅེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Within the Tathāgata Vigatasaṃtāpodbhavavaiśravaṇasālarāja’s assembly there were two bodhisattvas, one named Vigopaśikhara and one named Saṃrocanabuddha.
